Revit 2027 API
AreaLoad.GetLoops Method
 Returns curve loops that define geometry of the area load.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<CurveLoop> GetLoops()
Public Function GetLoops As IList(Of CurveLoop)
public:
IList<CurveLoop^>^ GetLoops()
member GetLoops : unit -> IList<CurveLoop>
Return Value
IList<CurveLoop>
See Also
Reference
AreaLoad Class
Autodesk.Revit.DB.Structure Namespace